Revit 2026 API

# ContentNode Methods

---

The ContentNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAsset | Returns an an instance of an Asset object, which contains definitions of the content node. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTransform | A transformation matrix associated with the node. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ContentNode Class

Autodesk.Revit.DB Namespace